-- コメント                                 -- コメント
SELECT カラム                               -- カラム
FROM テーブル                               -- テーブル
WHERE 条件                                  -- もし
ORDER BY カラム 並べ方(昇順:ASC, 降順:DESC) -- 並べ替え
LIMIT 件数                                  -- 件数
0                                           -- 整数型(int)
0.0                                         -- 小数型(float)
"A"                                         -- 文字列型()
"0000-00-00"                                -- 日付型(date)
"00:00:00"                                  -- 時刻型(time)
"0000-00-00 00:00:00"                       -- 日時型(datetime)
NULL                                        -- 空白型(NULL)
+                                           -- 足す
-                                           -- 引く
*                                           -- 掛ける
/                                           -- 割る
=                                           -- 同じ
<                                           -- 小なり
<=                                          -- 小なりイコール
>                                           -- 大なり
>=                                          -- 大なりイコール
LIKE "%文字列%"                             -- 含む
IS                                          -- 型が同じ
IS NOT                                      -- 型が違う
AND                                         -- かつ
OR                                          -- または
NOT                                         -- ではない
SUM(カラム)                                 -- 合計
DISTINCT(カラム)                            -- 重複削除

インストール
作成
登録
変更
削除
並べ替え
絞り込み